package problem05

/*
题：
替换空格
请实现一个函数，将一个字符串中的每个空格替换成"%20"。例如，当字符串为We Are Happy.替换后应为We%20Are%20Happy

方法一：从头到尾扫描字符串，每次碰到空格时进行替换，由于是把1个字符串替换成三个字符串，我们必须把空格后面的字符串后移2字节，否则就有两个字符被覆盖了。
对于长度为n的字符串，每个空格字符，都要移动后面的O(n)个字符串，对于含有O(n)个空格的字符串而言，总的时间效率为O(n^2)
方法二：方法一是从前面开始替换，因此第一次移动过的字符串后面可能还会移动，是不是可以让所有字符串只移动一次呢？
我们先遍历一遍字符串，统计出所有的空格，因此可以计算出替换后字符串的长度。我们从后面开始替换，先准备两个指针：
P1和P2,P1指向原始字符串末尾，P2指向替换后的字符串末尾。移动P1,逐步把p1指向的字符复制到P2指向的位置，P2也向左移动1位。
当P1遇到第一个空格时，P1向左移一格，P2之前插入"20%",P2向前移动3格。
当P1与P2在同一位置时，替换完成。 所有的字符串最多移动一次，因此这个方法效率为O(n) 使用c实现的的核心代码
*/
import (
	"fmt"
	"strings"
)

func repaceSpace(str string) string {
	return strings.Replace(str, " ", "%20", -1)
}
